UMSATS/cdh-tsat/cdh-tsat6-stm32project-nucleo/Core/Src/Si446x/Si446x.c
	}

	// Get response data
	for(uint8_t i=0;i<len;i++) {

		((uint8_t*)buff)[i] = spi_transfer(0xFF);

	}

	cdeselect(); // Break out of CS when done.

	return cts;

}


// Effectively Depreciated as its only caller is waitForResponse.
// Read CTS and if its ok then read the command buffer
static uint8_t getResponse(void* buff, uint8_t len)
{
	uint8_t cts = 0;

	// SI446X_ATOMIC()
	// { // BEGIN ATOMIC BLOCK.
		CHIPSELECT()
		{
			// Send command
			spi_transfer(SI446X_CMD_READ_CMD_BUFF);

			// Get CTS value
			cts = spi_transfer(0xFF);

			// Print CTS Value
			// HAL_UART_Transmit(&huart2, cts, 1, 0xFFFFFFFF);

			if(cts == 0xFF)
			{
				// Get response data
				for(uint8_t i=0;i<len;i++)
					((uint8_t*)buff)[i] = spi_transfer(0xFF);
			}
		}
	// } // END OF ATOMIC BLOCK
	return cts;
}

// Depreciated.
// Keep trying to read the command buffer, with timeout of around 500ms
static uint8_t waitForResponse(void* out, uint8_t outLen, uint8_t useTimeout)
{
	// With F_CPU at 8MHz and SPI at 4MHz each check takes about 7us + 10us delay
	uint16_t timeout = 500; // This should approximate about the same timeout? However with less checks.
	while(!getResponse(out, outLen))
	{
		// delay_ms(1); // Hoo boy this is slow. STM32 has no HAL routine for us delay.
		if(useTimeout && !--timeout)
		{
			SI446X_CB_CMDTIMEOUT();
			return 0;
		}
	}
	return 1;
}

static void doAPI(void* data, uint8_t len, void* out, uint8_t outLen)
{
	//SI446X_NO_INTERRUPT() // TODO: re-enable when there are interrupts to actually disable. -NJR
	//{
		// Wait until RF Module is ready. -NJR
		// Technically this is blocking but commands have to get through eventually. -NJR
		receiveResponse(NULL, 0);
		// SI446X_ATOMIC()
		// {
			CHIPSELECT()
			{
				for(uint8_t i=0;i<len;i++)
					spi_transfer(((uint8_t*)data)[i]); // (pgm_read_byte(&((uint8_t*)data)[i]));
			}
		// }

		if(((uint8_t*)data)[0] == SI446X_CMD_IRCAL) // If we're doing an IRCAL then wait for its completion without a timeout since it can sometimes take a few seconds
			waitForResponse(NULL, 0, 0); // Can swap. -NJR
		else if(out != NULL) // If we have an output buffer then read command response into it
			//waitForResponse(out, outLen, 1);
			receiveResponse(out, outLen);
	//}
}

// Configure a bunch of properties (up to 12 properties in one go)
static void setProperties(uint16_t prop, void* values, uint8_t len)
{
	// len must not be greater than 12

	uint8_t data[16] = {
		SI446X_CMD_SET_PROPERTY,
		(uint8_t)(prop>>8),
		len,
		(uint8_t)prop
	};

	// Copy values into data, starting at index 4
	memcpy(data + 4, values, len); // Probably no need to port as its C?

	doAPI(data, len + 4, NULL, 0);
}

// Set a single property
static inline void setProperty(uint16_t prop, uint8_t value)
{
	setProperties(prop, &value, 1);
}
/*
// Set a 16bit property
static void setProperty16(uint16_t prop, uint16_t value)
{
	uint8_t properties[] = {value>>8, value};
	setProperties(prop, properties, sizeof(properties));
}
*/
// Read a bunch of properties
static void getProperties(uint16_t prop, void* values, uint8_t len)
{
	uint8_t data[] = {
		SI446X_CMD_GET_PROPERTY,
		(uint8_t)(prop>>8),
		len,
		(uint8_t)prop
	};

	doAPI(data, sizeof(data), values, len);
}

// Read a single property
static inline uint8_t getProperty(uint16_t prop)
{
	uint8_t val;
	getProperties(prop, &val, 1);
	return val;
}

// Do an ADC conversion
static uint16_t getADC(uint8_t adc_en, uint8_t adc_cfg, uint8_t part)
{
	uint8_t data[6] = {
		SI446X_CMD_GET_ADC_READING,
		adc_en,
		adc_cfg
	};
	doAPI(data, 3, data, 6);
	return (data[part]<<8 | data[part + 1]);
}

// Read a fast response register
static uint8_t getFRR(uint8_t reg)
{
	uint8_t frr = 0;
	// SI446X_ATOMIC()
	// {
		CHIPSELECT()
		{
			spi_transfer(reg); // replaces spi_transfer_nr -NJR
			frr = spi_transfer(0xFF);
		}
	// }
	return frr;
}

// Ge the patched RSSI from the beginning of the packet
static int16_t getLatchedRSSI(void)
{
	uint8_t frr = getFRR(SI446X_CMD_READ_FRR_A);
	int16_t rssi = rssi_dBm(frr);
	return rssi;
}

// Get current radio state
static si446x_state_t getState(void)
{
	uint8_t state = getFRR(SI446X_CMD_READ_FRR_B);
	if(state == SI446X_STATE_TX_TUNE)
		state = SI446X_STATE_TX;
	else if(state == SI446X_STATE_RX_TUNE)
		state = SI446X_STATE_RX;
	else if(state == SI446X_STATE_READY2)
		state = SI446X_STATE_READY;
	return (si446x_state_t)state;
}

// Set new state
static void setState(si446x_state_t newState)
{
	uint8_t data[] = {
		SI446X_CMD_CHANGE_STATE,
		newState
	};
	doAPI(data, sizeof(data), NULL, 0);
}

// Clear RX and TX FIFOs
static void clearFIFO(void)
{
	// 'static const' saves 20 bytes of flash here, but uses 2 bytes of RAM
	static const uint8_t clearFifo[] = {
		SI446X_CMD_FIFO_INFO,
		SI446X_FIFO_CLEAR_RX | SI446X_FIFO_CLEAR_TX
	};
	doAPI((uint8_t*)clearFifo, sizeof(clearFifo), NULL, 0);
}

/*
// Sometimes the Si446x gets all messed up if it receives a bad packet, so we have to enable the INVALID SYNC interrupt when
// a new packet starts coming in. If the INVALID SYNC interrupt is triggered then RX mode is restarted. The interrupt is turned off again
// if the packet is successfully received.
void __attribute__((weak)) SI446X_CB_RXINVALIDSYNC(void)
{
	setState(IDLE_STATE);
	clearFIFO();

	uint8_t data = SI446X_CMD_START_RX; // Restart RX with same params as before (channel etc)
	doAPI(&data, sizeof(data), NULL, 0);
	
	// TODO turn off interrupt?
}
*/

// TODO use Si446x_setupCallback instead?
/*static void fix_invalidSync_irq(uint8_t enable)
{
	uint8_t data = getProperty(SI446X_INT_CTL_MODEM_ENABLE);
	enable ? (data |= 32) : (data &= ~32); // TODO use def for 32
	enabledInterrupts[IRQ_MODEM] = data;
	setProperty(SI446X_INT_CTL_MODEM_ENABLE, data);
}
*/
// Read pending interrupts
// Reading interrupts will also clear them
// Buff should either be NULL (just clear interrupts) or a buffer of atleast 8 bytes for storing statuses
static void interrupt(void* buff)
{
	uint8_t data = SI446X_CMD_GET_INT_STATUS;
	doAPI(&data, sizeof(data), buff, 8);
}

// Similar to interrupt() but with the option of not clearing certain interrupt flags
static void interrupt2(void* buff, uint8_t clearPH, uint8_t clearMODEM, uint8_t clearCHIP)
{
	uint8_t data[] = {
		SI446X_CMD_GET_INT_STATUS,
		clearPH,
		clearMODEM,
		clearCHIP
	};
	doAPI(data, sizeof(data), buff, 8);
}

// Reset the RF chip
static void resetDevice(void)
{
    SDN_PORT->BSRR = 1 << (SI446X_SDN_BIT + 16); // Upper half of BSRR Register corresponds to setting pin LOW.
    delay_ms(50);
    SDN_PORT->BSRR = 1 << (SI446X_SDN_BIT); // Upper half of BSRR Register corresponds to setting pin HIGH.
    delay_ms(50);
    SDN_PORT->BSRR = 1 << (SI446X_SDN_BIT + 16);
    delay_ms(50);
}

